Revit 2027 API
WorksharingDisplaySettings.UserHasGraphicOverrides Method
 Checks whether there are graphic overrides that would apply to elements owned by the given user in the "Individual Owners" display mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UserHasGraphicOverrides(
	string username
)
Public Function UserHasGraphicOverrides (
	username As String
) As Boolean
public:
bool UserHasGraphicOverrides(
	String^ username
)
member UserHasGraphicOverrides :
        username : string -> bool
Parameters
username String
 The username to check
Return Value
Boolean
 True if there are graphic overrides assigned to the username, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 There will always be graphic overrides for all users included in the user table. In addition, there may be other users who have been explicitly assigned overrides.
See Also
Reference
WorksharingDisplaySettings Class
Autodesk.Revit.DB Namespace